In [ ]:
#Groupby
"""
A groupby operation involves some combination of 
splitting the object, 
applying a function, 
and combining the results. 
This can be used to group large amounts of data and compute operations on these groups.
"""

# Process we do in groupby
- Splitting 
- Aggregations 
- Fiteration 
- Transformation

In [1]:
import pandas as pd

In [2]:
#dict of list
ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
#create df using above data
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [ ]:
#i want the unique Team Names/find out total teams in dataset
# which teams are present

In [ ]:
# How many total teams we have???

In [ ]:
#find out the total count (teamwise)

In [ ]:
#Group DataFrame using a mapper or by a Series of columns.
#groupby on the basis of Team column

In [ ]:
#listify

In [ ]:
#use for loop

In [ ]:
#fetch data of only MI

In [ ]:
# without groupby normal solutions:fetch data of only MI

In [ ]:
#to get same answer use query

#supply column name directly, and valuename in '' or ""

In [ ]:
#use groups


#dict as an output
#it gives team name : index(where it is present)

In [ ]:
df

In [ ]:
#take yearwise mean of points
# i want yearwise avg points

In [ ]:
#take sum of all points yearwise

In [ ]:
#fetch only teams with rank 1

In [ ]:
# we can use multiple columns in groupby
# ex. Team & year

In [ ]:
# groupby 'Team','Year' fetch 'CSK',2015 and get only Points','Rank' data

In [ ]:
#fetch 1st entry of each category(rank) according to Team with Rank groupby
#list(df.groupby('Rank'))

#last()

In [ ]:
#rankwise 1st entry
#list(df.groupby('Rank'))
#first()

In [ ]:
#last()

# Iterations over Group

In [4]:
#Iterating through groups
#Problem statement: Identify yearwise records  from whole dataset
list(df.groupby('Year'))

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [5]:
#for loop on year
# i contains year+data
for i in df.groupby('Year'):
    print(i)

(2014,      Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701)
(2015,       Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804)
(2016,   Team  Rank  Year  Points
6  CSK     1  2016     756
8   MI     2  2016     694)
(2017,    Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690)

In [6]:
for i in df.groupby('Year'):
    print(i[0]) # will give year

2014
2015
2016
2017

In [8]:
# unpack data
for yr,data in df.groupby('Year'):
    print(data)

     Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804
  Team  Rank  Year  Points
6  CSK     1  2016     756
8   MI     2  2016     694
   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [11]:
#fetch record of 2015 without using groupby
df[df.Year == 2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [12]:
# use query for same
df.query('Year==2015')

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [14]:
# in query can we put 2 conditions : YES
# Fetch Rank 1 data for CSK
df.query('Rank==1')

      Team  Rank  Year  Points
0       MI     1  2014     876
6      CSK     1  2016     756
7      CSK     1  2017     788
10  Royals     1  2015     804

In [15]:
df.query('Rank==1 & Team=="CSK"')

  Team  Rank  Year  Points
6  CSK     1  2016     756
7  CSK     1  2017     788

In [ ]:
#df[df.loc[:,'Year']==2015]

In [ ]:
#grouped = df.groupby('Year')
#grouped.get_group(2015)

In [ ]:
#wantto fetch the data of year =2014
#list(df.groupby('Year'))[0]

In [ ]:
#i want record of year 2017
#df.groupby('Year').get_group(2017)

In [ ]:
# i want the team who stood 1st max times in ipl
#df.groupby('Rank').get_group(1)

In [ ]:
#df.groupby('Rank').get_group(1)['Team'].value_counts()

## Aggregation

In [4]:
#Aggregations #It contains: sum mean median mode std
#Aggregations work only on Numeric fields
import pandas as pd
import numpy as np

grouped = df.groupby('Year')
grouped['Points']

In [5]:
list(df.groupby('Year')['Points'])

[(2014,
  0    876
  2    863
  4    741
  9    701
  Name: Points, dtype: int64),
 (2015,
  1     789
  3     673
  5     812
  10    804
  Name: Points, dtype: int64),
 (2016,
  6    756
  8    694
  Name: Points, dtype: int64),
 (2017,
  7     788
  11    690
  Name: Points, dtype: int64)]

In [9]:
grouped = df.groupby('Year')
grouped['Points'].agg(np.max) # or use python sum function

Year
2014    876
2015    812
2016    756
2017    788
Name: Points, dtype: int64

In [37]:
df.groupby('Year').mean().Points

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [10]:
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [24]:
grouped = df.groupby('Team')
grouped.agg(np.size) #here size is nothing but occurance

        Rank  Year  Points
Team
CSK        3     3       3
Devils     2     2       2
Kings      1     1       1
MI         4     4       4
Royals     2     2       2

In [27]:
df.Team.value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [28]:
#Applying Multiple Aggregation Functions at Once
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std,min,max])

         sum        mean         std  min  max
Team
CSK     2356  785.333333   28.095077  756  812
Devils  1536  768.000000  134.350288  673  863
Kings    741  741.000000         NaN  741  741
MI      3049  762.250000   88.567771  690  876
Royals  1505  752.500000   72.831998  701  804

In [32]:
df.groupby('Team')[['Year','Points']].agg([sum,max,min])

        Year             Points
         sum   max   min    sum  max  min
Team
CSK     6048  2017  2015   2356  812  756
Devils  4029  2015  2014   1536  863  673
Kings   2014  2014  2014    741  741  741
MI      8062  2017  2014   3049  876  690
Royals  4029  2015  2014   1505  804  701

## Transformation

In [5]:
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [6]:
df.Points

0     876
1     789
2     863
3     673
4     741
5     812
6     756
7     788
8     694
9     701
10    804
11    690
Name: Points, dtype: int64

In [17]:
#Transformation calling a function over the selected data
#grouped = df.groupby('Team')
# write a function to add +500 points to each team
score = lambda x: x + 500
#grouped['Points'].transform(score)
#df.groupby('Team').Points.transform(lambda x: x + 500)
df.Points.transform(score)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [14]:
list(df.groupby('Team').Points)

[('CSK',
  5    812
  6    756
  7    788
  Name: Points, dtype: int64),
 ('Devils',
  2    863
  3    673
  Name: Points, dtype: int64),
 ('Kings',
  4    741
  Name: Points, dtype: int64),
 ('MI',
  0     876
  1     789
  8     694
  11    690
  Name: Points, dtype: int64),
 ('Royals',
  9     701
  10    804
  Name: Points, dtype: int64)]

In [15]:
df.Points + 500

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [43]:
df.Points.map(lambda x: x+500)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [ ]:
df.Points+500

In [ ]:
#list(df.groupby('Team')['Points'])
df.groupby('Team')['Points'].transform(lambda x:x+100)

In [ ]:
list(df.groupby('Team')['Rank'])

In [ ]:
# I want to give the +10 exxtra points to csk using transform
# I want to give extra +10 point only to the teams from year 2015